<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $permissions = [
            'عرض الادوار',
            'انشاء الادوار',
            'تعديل الادوار',
            'حذف الادوار',
            'عرض الاعلانات',
            'انشاء الاعلانات',
            'تعديل الاعلانات',
            'حذف الاعلانات',
            'عرض السلايدر',
            'انشاء السلايدر',
            'تعديل السلايدر',
            'حذف السلايدر',
            'قائمة المشرفين',
            'اضافة المشرفين',
            'تعديل المشرفين',
            'حذف المشرفين',
            'عرض الاعدادات',
            'تعديل الاعدادات',
            'العمليات المؤكدة',
            'ادارة عمليات السحب',
            'العمليات المرفوضة',
            'الموافقة على السحب',
            'رفض السحب',
            'عرض الروابط',
            'اضافة رابط',
            'تعديل رابط',
            'حذف رابط',
            'متابعة العمل',
            'عرض السوشيال',
            'انشاء السوشيال',
            'تعديل السوشيال',
            'حذف السوشيال',
            'مراجعة الاشتراكات',
            'الاشتراكات المفعلة',
            'الاشتراكات الملغية',
            'الغاء الاشتراك',
            'اعادة تفعيل الاشتراك',
            'تفعيل الاشتراك',
            'البحث في الاشتراكات',
            'روابط الدعوة',
            'كل الفيديوهات',
            'رفع فيديو',
            'حذف فيديو',
        ];
       
        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
